```bash
  # module.github_actions_oidc.data.aws_iam_policy_document.github_actions_trust will be read during apply
 <= data "aws_iam_policy_document" "github_actions_trust" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:ByeongHunKim:Terraform:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.github_actions_oidc.aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-oidc-provider"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all        = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-oidc-provider"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Region"      = "ap-northeast-2"
        }
      + thumbprint_list = (known after apply)
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_actions_oidc.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-study-dev-github-actions-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-github-actions-role"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Purpose"     = "GitHub Actions OIDC federated role"
          + "Region"      = "ap-northeast-2"
        }
      + tags_all              = {
          + "CostCenter"  = "terraform-study-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-study-dev-github-actions-role"
          + "Owner"       = "meiko"
          + "Project"     = "terraform-study"
          + "Purpose"     = "GitHub Actions OIDC federated role"
          + "Region"      = "ap-northeast-2"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github_actions_oidc.aws_iam_role_policy_attachment.github_actions_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "terraform-study-dev-github-actions-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```